{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 1], "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "dtype": "float32", "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 6, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "tanh"}, "class_name": "Conv2D"}, {"config": {"name": "average_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "AveragePooling2D"}, {"config": {"name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "tanh"}, "class_name": "Conv2D"}, {"config": {"name": "average_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "AveragePooling2D"}, {"config": {"name": "conv2d_3", "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 120, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "tanh"}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 84, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 10, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}